<a href="https://colab.research.google.com/github/RajeshNaidu1/DataScience/blob/main/Pandas_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
dates= pd.date_range('today',periods=6)
print(dates)

DatetimeIndex(['2021-10-23 12:33:12.118494', '2021-10-24 12:33:12.118494',
               '2021-10-25 12:33:12.118494', '2021-10-26 12:33:12.118494',
               '2021-10-27 12:33:12.118494', '2021-10-28 12:33:12.118494'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
import numpy as np
num_arr=np.random.randn(6,4)
rows=['1','2','3','4','5','6']
columns=['A','B','C','D']
df1 = pd.DataFrame(num_arr,index=rows,columns=columns)
print(df1)

          A         B         C         D
1  0.366883 -0.798902 -2.024135  0.987822
2  2.077199  0.395810 -0.579477  1.301835
3 -0.106292 -1.147522 -0.062454 -0.619136
4  1.185833 -0.877387  0.009641 -1.046817
5  1.065012  2.086120  0.620503 -0.015058
6 -0.462015 -0.367520 -1.026435 -0.710331

In [ ]:
data = {'animal': ['cat','dog','cat','dog','mouse','tiger','cow','buffalo'],
        'age': [2,1,2,3,4,1,5,6],
        'visits': [1,3,6,2,0,1,5,2],
        'priority': ['y','y','n','n','y','y','n','y']}
rows= ['a','b','c','d','e','f','g','h']
df2=pd.DataFrame(data,index=rows)
df2

    animal  age  visits priority
a      cat    2       1        y
b      dog    1       3        y
c      cat    2       6        n
d      dog    3       2        n
e    mouse    4       0        y
f    tiger    1       1        y
g      cow    5       5        n
h  buffalo    6       2        y

In [ ]:
#to know the datatypes
df2.dtypes

animal      object
age          int64
visits       int64
priority    object
dtype: object

In [ ]:
#to returning some of the rows
df2.head(2)

  animal  age  visits priority
a    cat    2       1        y
b    dog    1       3        y

In [ ]:
df2.tail(3)

    animal  age  visits priority
f    tiger    1       1        y
g      cow    5       5        n
h  buffalo    6       2        y

In [ ]:
df2.values

array([['cat', 2, 1, 'y'],
       ['dog', 1, 3, 'y'],
       ['cat', 2, 6, 'n'],
       ['dog', 3, 2, 'n'],
       ['mouse', 4, 0, 'y'],
       ['tiger', 1, 1, 'y'],
       ['cow', 5, 5, 'n'],
       ['buffalo', 6, 2, 'y']], dtype=object)

In [ ]:
df2.describe()

           age    visits
count  8.00000  8.000000
mean   3.00000  2.500000
std    1.85164  2.070197
min    1.00000  0.000000
25%    1.75000  1.000000
50%    2.50000  2.000000
75%    4.25000  3.500000
max    6.00000  6.000000

In [ ]:
#Transpose
df2.T

            a    b    c    d      e      f    g        h
animal    cat  dog  cat  dog  mouse  tiger  cow  buffalo
age         2    1    2    3      4      1    5        6
visits      1    3    6    2      0      1    5        2
priority    y    y    n    n      y      y    n        y

In [ ]:
#sort by age
df2.sort_values(by='age')

    animal  age  visits priority
b      dog    1       3        y
f    tiger    1       1        y
a      cat    2       1        y
c      cat    2       6        n
d      dog    3       2        n
e    mouse    4       0        y
g      cow    5       5        n
h  buffalo    6       2        y

In [ ]:
#slicing
df2[1:3]

  animal  age  visits priority
b    dog    1       3        y
c    cat    2       6        n

In [ ]:
df2.sort_values(by='age')[1:3]

  animal  age  visits priority
f  tiger    1       1        y
a    cat    2       1        y

In [ ]:
#query dataframe by tag
df2[['age','visits']]

   age  visits
a    2       1
b    1       3
c    2       6
d    3       2
e    4       0
f    1       1
g    5       5
h    6       2

In [ ]:
#copy
df3=df2.copy()
df3

    animal  age  visits priority
a      cat    2       1        y
b      dog    1       3        y
c      cat    2       6        n
d      dog    3       2        n
e    mouse    4       0        y
f    tiger    1       1        y
g      cow    5       5        n
h  buffalo    6       2        y

In [ ]:
#for editing a certain location
df3.loc['d','age']=4
df3

    animal  age  visits priority
a      cat    2       1        y
b      dog    1       3        y
c      cat    2       6        n
d      dog    4       2        n
e    mouse    4       0        y
f    tiger    1       1        y
g      cow    5       5        n
h  buffalo    6       2        y

In [ ]:
#mean of columns
df3.mean()

age       3.125
visits    2.500
dtype: float64

In [ ]:
#mean of certain column
df3[['age']].mean()
#we can do all mean,sum,count,std,max,min,....

age    3.125
dtype: float64

In [ ]:
#opertions with missing values
data1 = {'animal': ['cat','dog','cat','dog','mouse','tiger','cow','buffalo'],
        'age': [2,1,2,3,np.nan,1,5,6],
        'visits': [1,3,np.nan,2,0,1,5,2],
        'priority': ['y','y','n','n','y','y','n','y']}
rows1= ['a','b','c','d','e','f','g','h']
df4=pd.DataFrame(data1,index=rows1)
df4

    animal  age  visits priority
a      cat  2.0     1.0        y
b      dog  1.0     3.0        y
c      cat  2.0     NaN        n
d      dog  3.0     2.0        n
e    mouse  NaN     0.0        y
f    tiger  1.0     1.0        y
g      cow  5.0     5.0        n
h  buffalo  6.0     2.0        y

In [ ]:
#filling NaN location
df4.fillna(4)

    animal  age  visits priority
a      cat  2.0     1.0        y
b      dog  1.0     3.0        y
c      cat  2.0     4.0        n
d      dog  3.0     2.0        n
e    mouse  4.0     0.0        y
f    tiger  1.0     1.0        y
g      cow  5.0     5.0        n
h  buffalo  6.0     2.0        y

In [ ]:
#customise the NaN value
meanAge= df3[['age']].mean()
df4.fillna(meanAge)

    animal    age  visits priority
a      cat  2.000     1.0        y
b      dog  1.000     3.0        y
c      cat  2.000     NaN        n
d      dog  3.000     2.0        n
e    mouse  3.125     0.0        y
f    tiger  1.000     1.0        y
g      cow  5.000     5.0        n
h  buffalo  6.000     2.0        y

In [ ]:
# remove the row which has NaN value
df4.dropna(how='any')

    animal  age  visits priority
a      cat  2.0     1.0        y
b      dog  1.0     3.0        y
d      dog  3.0     2.0        n
f    tiger  1.0     1.0        y
g      cow  5.0     5.0        n
h  buffalo  6.0     2.0        y